title: Risk of signup fraud - rapid creation of fake accounts
id: 3a9be414-716e-11f0-8153-723487b9527c
status: experimental
description: >
    Detect potential signup fraud by monitoring the following events:  surge in a number of registration, excessive failed signups,  or too many signup attempts with use of breached passwords.
author: Okta
date: 2025-07-11
modified: 2025-08-04
logsource:
    product: auth0
    service: signup
detection:
    selection:
        data.type: IN ("fs","ss","signup_pwd_leak")
    condition: selection
explanation: The query alerts when one of the thresholds exceeds - number of successful signups, failed signups, or signups attempts with breached passwords.
splunk: >
    index=auth0 data.type IN ("fs","ss","signup_pwd_leak")
    | bin _time span=1h
    | chart count by _time, data.type
    | fillnull value=0
    | rename fs as count_fs, ss as count_ss, signup_pwd_leak as count_signup_pwd_leak
    | where count_fs >= {thresholds_failed_signups}
    | where count_ss >= {thresholds_successful_signups}
    | where count_signup_pwd_leak >= {thresholds_leaked_pwd}
comments:
    - The Splunk query above shall be tuned to reflect a valid tenant name.
    - The values for thresholds_failed_signups, thresholds_successful_signups, and thresholds_leaked_pwd should be set based on the customer's environment and expected behavior.
    - To learn normality, it is recommended to run the query (excluding "where" clauses) for a period of time and calculate the thresholds based on the observed data.
    - A similar detection (with less details) can be implemented through Security Center and its alerts.
tenant_logs:
    type:"fs" OR type:"ss" OR type:"signup_pwd_leak"
prevention:
    - Enable Attack protection features
    - Migrate to passwordless authentication
    - Collect attribution of the fraudulent traffic (IPs, ASNs, Geo), and block the obviously malicious sources, e.g. with Tenant ACL.
falsepositives:
    - Legitimate users signing up with a large number of accounts, e.g. as result of the black friday.
level: medium
tags:
    - attack.resource-development
    - attack.t1136
