title: Risk for account takeover - same Guardian application device is registered for MFA to multiple users
id: bad8fcc0-716e-11f0-b852-723487b9527c
status: experimental
description: |
    An adversary may register their own MFA devices, often leveraging the same device for multiple compromised accounts to maintain persistence.
author: Okta
date: 2025-07-11
modified: 2025-09-02
logsource:
    product: auth0
    service: mfa
detection:
    selection:
        data.type: gd_enrollment_complete
        data.description: "Guardian - Enrollment complete"
    condition: selection
explanation: >
    The detection is tracking Guardian app enrollment identifiers across users.
    The Splunk query when more than 1 user has been registered with the same Guardian App - adjust.
splunk: |
    index=auth0 data.tenant_name="{your-tenant-name}"
    data.type=gd_enrollment_complete data.description="Guardian - Enrollment complete"
    | fields data.user_id, data.ip, data.details.enrollment.identifier
    | stats dc(data.user_id) as users_count values(data.ip) by data.details.enrollment.identifier
    | where users_count > 1
comments:
    - The Splunk query above shall be tuned to reflect a valid tenant name.
    - For customer identity, the users can leverage the same MFA for several accounts for legitimate reasons,
      e.g. a user has several accounts in the same tenant across several applications.
    - To filter out false positives, look at the users' emails or users' names.
    - Also, consider adjusting the users_count to decrease sensitivity.
tenant_logs: |
    type: "gd_enrollment_complete" AND description: "Guardian - Enrollment complete"
prevention:
    - Require strong MFA factors.
falsepositives:
    - Legitimate users using the same device for multiple accounts, e.g. shared devices in family or work environments.
level: medium
tags:
    - attack.persistence
    - attack.t1098
