title: Risk for misconfiguration - use of Auth0 tenant name URL.
id: 466073e8-7171-11f0-858f-723487b9527c
status: experimental
description: >
    Detect the use of Auth0 canonical domain/tenant name url, when a custom domain is configured.
    When a custom domain is configured, there is often no reason for legitimate applications to use the default Auth0 domain.
    An attempt to access the tenant using the default Auth0 domain that may indicate a misconfiguration or an attack.
    Bypassing of a custom domain can lead to circumventing of such protections as WAF, IP filters, and advanced logging.
author: Okta
date: 2025-07-11
modified: 2025-08-04
logsource:
    product: auth0
    service: oidc_oauth2
detection:
    selection:
        data.type:
            - s  # successful login
            - f  # failed login
            - fs # failed signup
            - ss # successful signup
            - w # warning during login
            - fp # failed login (incorrect password)
            - scoa # successful cross-origin authentication
            - fcoa # failed cross-origin authentication
            - sepft # successful exchange of password for token
            - fepft # failed exchange of password for token
        data.hostname: "{your-tenant-url}"  # e.g. your-tenant.auth0.com
    condition: selection
explanation: >
  The query below collects log entries corresponding to authentication events, e.g. s-successful login, f-failed login, etc.
  It filters those requests that use the Auth0 tenant name URL by checking "data.hostname".
  The splunk query below displays clints/applications and log references.
splunk: >
    index=auth0 data.tenant_name="{your-tenant-name}"
    data.type IN ("s", "f", "fs", "ss", "w", "fp", "scoa", "fcoa", "sepft", "fepft")
    data.hostname="{your-tenant-url}"
    | table _time, data.client_id, data.client_name, data.log_id
comments:
    - The splunk query above shall be tuned to reflect a valid tenant_name.
tenant_logs: >
    type: (s f fs ss f u fp scoa fcoa sepft fepft) AND hostname: {your-tenant-url}
prevention: >
    When any sort of a reverse proxy (e.g. WAF) is used in front of the tenant and IPs of this proxy can be listed,
    Auth0 Network ACL (Access Control List) can be applied to block any entries from
    unrecognized IPs.
falsepositives:
    - Legitimate use of the Auth0 tenant name URL, e.g. during testing or misconfiguration.
level: low
tags:
    - attack.defense-evasion
    - attack.t1562
    - attack.t1562.007
